{"cited_in": [], "datas": {"publication_uid": "18201224", "title": "Receptive Fields and Functional Architecture of Monkey Striate Cortex", "authors": {"1": "D.H. Hubel", "2": "T.N. Wiesel"}, "abstract": "  ABSTRACT 1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded.2. Evidence is presented for at least two independent systems of columns extending vertically from surface to white matter. Columns of the first type contain cells with common receptive-field orientations. They are similar to the orientation columns described in the cat, but are probably smaller in cross-sectional area. In the second system cells are aggregated into columns according to eye preference. The ocular dominance columns are larger than the orientation columns, and the two sets of boundaries seem to be independent.3. There is a tendency for cells to be grouped according to symmetry of responses to movement; in some regions the cells respond equally well to the two opposite directions of movement of a line, but other regions contain a mixture of cells favouring one direction and cells favouring the other.4. A horizontal organization corresponding to the cortical layering can also be discerned. The upper layers (II and the upper two-thirds of III) contain complex and hypercomplex cells, but simple cells are virtually absent. The cells are mostly binocularly driven. Simple cells are found deep in layer III, and in IV A and IV B. In layer IV B they form a large proportion of the population, whereas complex cells are rare. In layers IV A and IV B one finds units lacking orientation specificity; it is not clear whether these are cell bodies or axons of geniculate cells. In layer IV most cells are driven by one eye only; this layer consists of a mosaic with cells of some regions responding to one eye only, those of other regions responding to the other eye. Layers V and VI contain mostly complex and hypercomplex cells, binocularly driven.5. The cortex is seen as a system organized vertically and horizontally in entirely different ways. In the vertical system (in which cells lying along a vertical line in the cortex have common features) stimulus dimensions such as retinal position, line orientation, ocular dominance, and perhaps directionality of movement, are mapped in sets of superimposed but independent mosaics. The horizontal system segregates cells in layers by hierarchical orders, the lowest orders (simple cells monocularly driven) located in and near layer IV, the higher orders in the upper and lower layers.  "}, "references": ["https://www.researchgate.net/publication/9137961_Hubel_D_H_Wiesel_T_N_Receptive_fields_binocular_interaction_and_functional_architecture_of_cat's_visual_cortex_J_Physiol_Lond_160_106-154", "https://www.researchgate.net/publication/10127891_Mountcastle_VB_Modality_and_topographic_properties_of_single_neurons_of_cat's_somatic_sensory_cortex_J_Neurophys_20_408-434", "https://www.researchgate.net/publication/18206407_Wiesel_T_N_Hubel_D_H_Spatial_and_chromatic_interactions_in_the_lateral_geniculate_body_of_the_rhesus_monkey_J_Neurophysiol_29_1115-1156", "https://www.researchgate.net/publication/6046324_Tungsten_Microelectrode_for_Recording_from_Single_Units", "https://www.researchgate.net/publication/9995845_Cortical_Unit_Responses_to_Visual_Stimuli_in_Nonanesthetized_Cats", "https://www.researchgate.net/publication/9684489_The_representation_of_the_visual_field_on_the_cerebral_cortex_of_monkeys_J_Physiol", "https://www.researchgate.net/publication/17214409_Orientational_selectivity_of_the_human_visual_system", "https://www.researchgate.net/publication/9184022_'Receptive_Fields_of_Single_Neurones_in_the_Cat's_Striate_Cortex'", "https://www.researchgate.net/publication/9184021_Hubel_DH_Single_unit_activity_in_striate_cortex_of_unrestrained_cats_J_Physiol_147_226-238", "https://www.researchgate.net/publication/18782681_Organization_of_the_primate_retina_electron_microscopy_Proc_R_Soc_Lond_B_Biol_Sci", "https://www.researchgate.net/publication/9612500_Shape_and_arrangement_of_columns_in_cat's_striate_cortex_J_Physiol", "https://www.researchgate.net/publication/17301885_Hubel_D_H_Wiesel_T_N_Binocular_interaction_in_striate_cortex_of_kittens_raised_with_artificial_squint_J_Neurophysiol_28_1041-1059", "https://www.researchgate.net/publication/9851521_Receptive_fields_of_optic_nerve_in_the_spider_monkey", "https://www.researchgate.net/publication/9631361_Spectral_Responses_of_Single_Units_in_the_Primate_Visual_Cortex", "https://www.researchgate.net/publication/9301289_Receptive_Fields_and_Functional_Architecture_in_Two_Nonstriate_Visual_Areas_18_and_19_of_the_Cat", "https://www.researchgate.net/publication/248316581_Vergleichende_Lokalisationslehre_der_Grosshirnrinde", "https://www.researchgate.net/publication/243772841_Physiological_studies_of_visual_localization_and_discrimination"]}