{"cited_in": ["https://www.researchgate.net/publication/280877274_Des_millions_d'images_pour_la_steganalyse_inutile", "https://www.researchgate.net/publication/258713318_Identifying_a_steganographer_in_realistic_and_heterogeneous_data_sets", "https://www.researchgate.net/publication/261387327_Steganalysis_by_Ensemble_Classifiers_with_Boosting_by_Regression_and_Post-Selection_of_Features", "https://www.researchgate.net/publication/262236864_Moving_Steganography_and_Steganalysis_from_the_Laboratory_into_the_Real_World", "https://www.researchgate.net/publication/259639875_Universal_Distortion_Function_for_Steganography_in_an_Arbitrary_Domain", "https://www.researchgate.net/publication/264902820_Steganalysis_with_Cover-Source_Mismatch_and_a_Small_Learning_Database", "https://www.researchgate.net/publication/264387367_The_Steganographer_is_the_Outlier_Realistic_Large-Scale_Steganalysis"], "datas": {"publication_uid": "253393301", "title": "Detecting messages of unknown length", "authors": {"1": "Tomas Pevny"}, "abstract": "This work focuses on the problem of developing a blind steganalyzer (a steganalyzer relying on machine learning algorithm and steganalytic features) for detecting stego images with different payload. This problem is highly relevant for practical forensic analysis, since in practice, the knowledge about the steganographic channel is very limited, and the length of hidden message is generally unknown. This paper demonstrates that the discrepancy between payload in training and testing / application images can significantly decrease the accuracy of the steganalysis. Two fundamentally different approaches to mitigate this problem are then proposed. The first solution relies on quantitative steganalyzer. The second solution transforms one-sided hypothesis test (unknown message length) to simple hypothesis test by assuming a probability distribution on length of messages, which can be efficiently solved by many machine-learning tools, e.g. by Support Vector Machines. The experimental section of the paper (a) compares both solutions on steganalysis of F5 algorithm with shrinkage removed by wet paper codes for JPEG images and LSB matching for raw (uncompressed) images, (b) investigates the effect of the assumed distribution of the message length on the accuracy of the steganalyzer, and (c) shows how the accuracy of steganalysis depends on Eve's knowledge about details of steganographic channel."}, "references": ["https://www.researchgate.net/publication/220942208_The_square_root_law_of_steganographic_capacity", "https://www.researchgate.net/publication/220942125_Novelty_detection_in_blind_steganalysis", "https://www.researchgate.net/publication/221210723_From_blind_to_quantitative_steganalysis"]}