{"cited_in": [], "datas": {"publication_uid": "266266206", "title": "Detección Automática de Cráteres en Imágenes HSRC", "authors": {"1": "Fernando Martín-Rodríguez", "3": "José Luis Vázquez-García", "2": "Andrés Martínez Mera"}, "abstract": "  ABSTRACT This paper describes an image analysis application designed to automatically detect craters in the HRSC images taken from the Mars surface. HRSC images are generated by the HSRC camera on board the Mars Express spacecraft. This sensor can produce stereo and color pictures although we will work with grayscale images. The main purpose of this application is to perform an automatic detection of craters on each image to make easier the work of geologists studying Mars surface. Craters are very important to geological studies and we want the image database to be labeled so that it is easy to find all craters. The application will be run offline, detecting crater positions for future use. To accomplish crater detection we have implemented a classical approach: we segment crater candidates using a Hough transform and then we use a neural network to classify them into true carters and false ones. Practical results are up to the state of the art.  "}, "references": ["https://www.researchgate.net/publication/3968745_Training_of_a_crater_detection_algorithm_for_Mars_crater_imagery", "https://www.researchgate.net/publication/2356181_Data_Mining_System_for_Planetary_Images_-_Crater_Detection_and_Categorization_-", "https://www.researchgate.net/publication/245168164_Detecting_the_skew_angle_in_document_images", "https://www.researchgate.net/publication/239060777_More_JJ_The_Levenberg-Marquardt_algorithm_Implementation_and_theory_Numer_Analysis_630_105-116", "https://www.researchgate.net/publication/233905634_Printed_and_Handwritten_Digits_Recognition_Using_Neural_Networks", "https://www.researchgate.net/publication/223303118_Automatic_detection_of_sub-km_craters_in_high_resolution_planetary_images"]}