{"cited_in": [], "datas": {"publication_uid": "269997625", "title": "Learning Deep Temporal Representations for Brain Decoding", "authors": {"1": "Fatos Tunay Yarman Vural", "4": "Fatos Tunay Yarman Vural", "3": "Ilke Oztekin", "2": "Emre Aksan"}, "abstract": "Functional magnetic resonance imaging produces high dimensional data, with a less then ideal number of labelled samples for brain decoding tasks (predicting brain states). In this study, we propose a new deep temporal convolutional neural network architecture with spatial pooling for brain decoding which aims to reduce dimensionality of feature space along with improved classification performance. Temporal representations (filters) for each layer of the convolutional model are learned by leveraging unlabelled fMRI data in an unsupervised fashion with regularized autoencoders. Learned temporal representations in multiple levels capture the regularities in the temporal domain and are observed to be a rich bank of activation patterns which also exhibit similarities to the actual hemodynamic responses. Further, spatial pooling layers in the convolutional architecture reduce the dimensionality without losing excessive information. By employing the proposed temporal convolutional architecture with spatial pooling, raw input fMRI data is mapped to a non-linear, highly-expressive and low-dimensional feature space where the final classification is conducted. In addition, we propose a simple heuristic approach for hyper-parameter tuning when no validation data is available. Proposed method is tested on a ten class recognition memory experiment with nine subjects. The results support the efficiency and potential of the proposed model, compared to the baseline multi-voxel pattern analysis techniques."}, "references": ["https://www.researchgate.net/publication/6993585_Decoding_mental_states_from_brain_activity_in_human", "https://www.researchgate.net/publication/261219975_Restricted_Boltzmann_Machines_for_Neuroimaging_An_Application_in_Identifying_Intrinsic_Networks", "https://www.researchgate.net/publication/224579211_Learning_invariant_features_through_topographic_filter_maps", "https://www.researchgate.net/publication/233539625_Kernel_Principal_Component_Analysis_for_dimensionality_reduction_in_fMRI-based_diagnosis_of_ADHD", "https://www.researchgate.net/publication/6888584_Beyond_Mind-Reading_Multi-Voxel_Pattern_Analysis_of_fMRI_Data", "https://www.researchgate.net/publication/263091712_Deep_Neural_Networks_Rival_the_Representation_of_Primate_IT_Cortex_for_Core_Visual_Object_Recognition"]}