{"cited_in": [], "datas": {"publication_uid": "280095845", "title": "High Performance Computation and Pattern Recognition Techniques for Detecting Lunar Craters Using Satellite Image- A Review", "authors": {"1": "D. Saranyaraj", "3": "S. Sivakumar", "2": "Sivakumar V"}, "abstract": "Craters, one of the utmost noteworthy landforms of the lunar surface, have been extensively researched because they offer us the revision of relative and absolute surface chronologies, erosional progressions, and origin evolution of lunar surface. The modern research emphases on identification of craters in terms of its characteristics and detection of these visual sorts of the moon to regulate asafe landing site for an astral lander. Craters seem in enough mass on most planetary system forms of interest and also known as a stable in advent or shapes over stretch or under diverse conditions and environs. Currently, there are a lot of ongoing researches mainly in craters recognition and ocular triangulation systems for the moon but still using a complex and similar approach. Hence, this paper reviewsvarious algorithms involved for identifying various types of craters, which will highly be influential for any future research work. In addition to this, this paper will also have a brief scenario about high performance computing in pattern recognition which will effectively help in the process of detecting the craters in much faster and effective way, totally autonomous on the algorithm chosen. This paper describes briefly about the parallelization of object recognition to identify several lunar craters parallel with high synchronization processor speed"}, "references": ["https://www.researchgate.net/publication/220660094_Robust_Real-Time_Face_Detection", "https://www.researchgate.net/publication/3916596_Parallel_image_classification_on_the_HIVE", "https://www.researchgate.net/publication/223303118_Automatic_detection_of_sub-km_craters_in_high_resolution_planetary_images", "https://www.researchgate.net/publication/220691638_Highly_Parallel_Computing", "https://www.researchgate.net/publication/220693683_The_Connection_Machine", "https://www.researchgate.net/publication/224262775_Hybrid_method_for_detection_of_lunar_craters_based_on_topography_reconstruction_from_optical_images", "https://www.researchgate.net/publication/251905432_Parallel_Processing_Architecture_of_Remotely_Sensed_Image_Processing_System_Based_on_Cluster", "https://www.researchgate.net/publication/220600711_Unsupervised_parallel_image_classification_using_Markovian_models", "https://www.researchgate.net/publication/224360174_Crater_Detection_by_a_Boosting_Approach"]}