{"cited_in": [], "datas": {"publication_uid": "289587709", "title": "Crater Detection via Convolutional Neural Networks", "authors": {"1": "Joseph Paul Cohen", "4": "Wei Ding", "3": "Tingting Lu", "2": "Henry Z. Lo"}, "abstract": "Craters are among the most studied geomorphic features in the Solar System because they yield important information about the past and present geological processes and provide information about the relative ages of observed geologic formations. We present a method for automatic crater detection using advanced machine learning to deal with the large amount of satellite imagery collected. The challenge of automatically detecting craters comes from their is complex surface because their shape erodes over time to blend into the surface. Bandeira provided a seminal dataset that embodied this challenge that is still an unsolved pattern recognition problem to this day. There has been work to solve this challenge based on extracting shape and contrast features and then applying classification models on those features. The limiting factor in this existing work is the use of hand crafted filters on the image such as Gabor or Sobel filters or Haar features. These hand crafted methods rely on domain knowledge to construct. We would like to learn the optimal filters and features based on training examples. In order to dynamically learn filters and features we look to Convolutional Neural Networks (CNNs) which have shown their dominance in computer vision. The power of CNNs is that they can learn image filters which generate features for high accuracy classification."}, "references": ["https://www.researchgate.net/publication/238539857_Automatic_Detection_of_Sub-km_Craters_Using_Shape_and_Texture_Information", "https://www.researchgate.net/publication/223303118_Automatic_detection_of_sub-km_craters_in_high_resolution_planetary_images", "https://www.researchgate.net/publication/220527426_Subkilometer_Crater_Discovery_with_Boosting_and_Transfer_Learning", "https://www.researchgate.net/publication/267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks"]}